MikroElektronika/core_packages/PIC/XC8/def/PIC16F18326/mcu.h
extern volatile FVRCONbits_t FVRCONbits __at(0x117);
// bitfield macros
#define _FVRCON_ADFVR_POSN                                  0x0
#define _FVRCON_ADFVR_POSITION                              0x0
#define _FVRCON_ADFVR_SIZE                                  0x2
#define _FVRCON_ADFVR_LENGTH                                0x2
#define _FVRCON_ADFVR_MASK                                  0x3
#define _FVRCON_CDAFVR_POSN                                 0x2
#define _FVRCON_CDAFVR_POSITION                             0x2
#define _FVRCON_CDAFVR_SIZE                                 0x2
#define _FVRCON_CDAFVR_LENGTH                               0x2
#define _FVRCON_CDAFVR_MASK                                 0xC
#define _FVRCON_TSRNG_POSN                                  0x4
#define _FVRCON_TSRNG_POSITION                              0x4
#define _FVRCON_TSRNG_SIZE                                  0x1
#define _FVRCON_TSRNG_LENGTH                                0x1
#define _FVRCON_TSRNG_MASK                                  0x10
#define _FVRCON_TSEN_POSN                                   0x5
#define _FVRCON_TSEN_POSITION                               0x5
#define _FVRCON_TSEN_SIZE                                   0x1
#define _FVRCON_TSEN_LENGTH                                 0x1
#define _FVRCON_TSEN_MASK                                   0x20
#define _FVRCON_FVRRDY_POSN                                 0x6
#define _FVRCON_FVRRDY_POSITION                             0x6
#define _FVRCON_FVRRDY_SIZE                                 0x1
#define _FVRCON_FVRRDY_LENGTH                               0x1
#define _FVRCON_FVRRDY_MASK                                 0x40
#define _FVRCON_FVREN_POSN                                  0x7
#define _FVRCON_FVREN_POSITION                              0x7
#define _FVRCON_FVREN_SIZE                                  0x1
#define _FVRCON_FVREN_LENGTH                                0x1
#define _FVRCON_FVREN_MASK                                  0x80
#define _FVRCON_ADFVR0_POSN                                 0x0
#define _FVRCON_ADFVR0_POSITION                             0x0
#define _FVRCON_ADFVR0_SIZE                                 0x1
#define _FVRCON_ADFVR0_LENGTH                               0x1
#define _FVRCON_ADFVR0_MASK                                 0x1
#define _FVRCON_ADFVR1_POSN                                 0x1
#define _FVRCON_ADFVR1_POSITION                             0x1
#define _FVRCON_ADFVR1_SIZE                                 0x1
#define _FVRCON_ADFVR1_LENGTH                               0x1
#define _FVRCON_ADFVR1_MASK                                 0x2
#define _FVRCON_CDAFVR0_POSN                                0x2
#define _FVRCON_CDAFVR0_POSITION                            0x2
#define _FVRCON_CDAFVR0_SIZE                                0x1
#define _FVRCON_CDAFVR0_LENGTH                              0x1
#define _FVRCON_CDAFVR0_MASK                                0x4
#define _FVRCON_CDAFVR1_POSN                                0x3
#define _FVRCON_CDAFVR1_POSITION                            0x3
#define _FVRCON_CDAFVR1_SIZE                                0x1
#define _FVRCON_CDAFVR1_LENGTH                              0x1
#define _FVRCON_CDAFVR1_MASK                                0x8

// Register: DACCON0
#define DACCON0 DACCON0
extern volatile unsigned char           DACCON0             __at(0x118);
#ifndef _LIB_BUILD
asm("DACCON0 equ 0118h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DAC1NSS                :1;
        unsigned                        :1;
        unsigned DAC1PSS                :2;
        unsigned                        :1;
        unsigned DAC1OE                 :1;
        unsigned                        :1;
        unsigned DAC1EN                 :1;
    };
    struct {
        unsigned                        :2;
        unsigned DAC1PSS0               :1;
        unsigned DAC1PSS1               :1;
    };
} DACCON0bits_t;
extern volatile DACCON0bits_t DACCON0bits __at(0x118);
// bitfield macros
#define _DACCON0_DAC1NSS_POSN                               0x0
#define _DACCON0_DAC1NSS_POSITION                           0x0
#define _DACCON0_DAC1NSS_SIZE                               0x1
#define _DACCON0_DAC1NSS_LENGTH                             0x1
#define _DACCON0_DAC1NSS_MASK                               0x1
#define _DACCON0_DAC1PSS_POSN                               0x2
#define _DACCON0_DAC1PSS_POSITION                           0x2
#define _DACCON0_DAC1PSS_SIZE                               0x2
#define _DACCON0_DAC1PSS_LENGTH                             0x2
#define _DACCON0_DAC1PSS_MASK                               0xC
#define _DACCON0_DAC1OE_POSN                                0x5
#define _DACCON0_DAC1OE_POSITION                            0x5
#define _DACCON0_DAC1OE_SIZE                                0x1
#define _DACCON0_DAC1OE_LENGTH                              0x1
#define _DACCON0_DAC1OE_MASK                                0x20
#define _DACCON0_DAC1EN_POSN                                0x7
#define _DACCON0_DAC1EN_POSITION                            0x7
#define _DACCON0_DAC1EN_SIZE                                0x1
#define _DACCON0_DAC1EN_LENGTH                              0x1
#define _DACCON0_DAC1EN_MASK                                0x80
#define _DACCON0_DAC1PSS0_POSN                              0x2
#define _DACCON0_DAC1PSS0_POSITION                          0x2
#define _DACCON0_DAC1PSS0_SIZE                              0x1
#define _DACCON0_DAC1PSS0_LENGTH                            0x1
#define _DACCON0_DAC1PSS0_MASK                              0x4
#define _DACCON0_DAC1PSS1_POSN                              0x3
#define _DACCON0_DAC1PSS1_POSITION                          0x3
#define _DACCON0_DAC1PSS1_SIZE                              0x1
#define _DACCON0_DAC1PSS1_LENGTH                            0x1
#define _DACCON0_DAC1PSS1_MASK                              0x8

// Register: DACCON1
#define DACCON1 DACCON1
extern volatile unsigned char           DACCON1             __at(0x119);
#ifndef _LIB_BUILD
asm("DACCON1 equ 0119h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DAC1R                  :5;
    };
    struct {
        unsigned DAC1R0                 :1;
        unsigned DAC1R1                 :1;
        unsigned DAC1R2                 :1;
        unsigned DAC1R3                 :1;
        unsigned DAC1R4                 :1;
    };
} DACCON1bits_t;
