MikroElektronika/core_packages/PIC/XC8/def/PIC16F18326/mcu.h
// Register: NVMADRH
#define NVMADRH NVMADRH
extern volatile unsigned char           NVMADRH             __at(0x892);
#ifndef _LIB_BUILD
asm("NVMADRH equ 0892h");
#endif
// aliases
extern volatile unsigned char           EEADRH              __at(0x892);
#ifndef _LIB_BUILD
asm("EEADRH equ 0892h");
#endif
extern volatile unsigned char           PMADRH              __at(0x892);
#ifndef _LIB_BUILD
asm("PMADRH equ 0892h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NVMADRH                :7;
    };
    struct {
        unsigned NVMADR8                :1;
        unsigned NVMADR9                :1;
        unsigned NVMADR10               :1;
        unsigned NVMADR11               :1;
        unsigned NVMADR12               :1;
        unsigned NVMADR13               :1;
        unsigned NVMADR14               :1;
    };
    struct {
        unsigned EEADRH                 :7;
    };
    struct {
        unsigned PMADRH                 :7;
    };
} NVMADRHbits_t;
extern volatile NVMADRHbits_t NVMADRHbits __at(0x892);
// bitfield macros
#define _NVMADRH_NVMADRH_POSN                               0x0
#define _NVMADRH_NVMADRH_POSITION                           0x0
#define _NVMADRH_NVMADRH_SIZE                               0x7
#define _NVMADRH_NVMADRH_LENGTH                             0x7
#define _NVMADRH_NVMADRH_MASK                               0x7F
#define _NVMADRH_NVMADR8_POSN                               0x0
#define _NVMADRH_NVMADR8_POSITION                           0x0
#define _NVMADRH_NVMADR8_SIZE                               0x1
#define _NVMADRH_NVMADR8_LENGTH                             0x1
#define _NVMADRH_NVMADR8_MASK                               0x1
#define _NVMADRH_NVMADR9_POSN                               0x1
#define _NVMADRH_NVMADR9_POSITION                           0x1
#define _NVMADRH_NVMADR9_SIZE                               0x1
#define _NVMADRH_NVMADR9_LENGTH                             0x1
#define _NVMADRH_NVMADR9_MASK                               0x2
#define _NVMADRH_NVMADR10_POSN                              0x2
#define _NVMADRH_NVMADR10_POSITION                          0x2
#define _NVMADRH_NVMADR10_SIZE                              0x1
#define _NVMADRH_NVMADR10_LENGTH                            0x1
#define _NVMADRH_NVMADR10_MASK                              0x4
#define _NVMADRH_NVMADR11_POSN                              0x3
#define _NVMADRH_NVMADR11_POSITION                          0x3
#define _NVMADRH_NVMADR11_SIZE                              0x1
#define _NVMADRH_NVMADR11_LENGTH                            0x1
#define _NVMADRH_NVMADR11_MASK                              0x8
#define _NVMADRH_NVMADR12_POSN                              0x4
#define _NVMADRH_NVMADR12_POSITION                          0x4
#define _NVMADRH_NVMADR12_SIZE                              0x1
#define _NVMADRH_NVMADR12_LENGTH                            0x1
#define _NVMADRH_NVMADR12_MASK                              0x10
#define _NVMADRH_NVMADR13_POSN                              0x5
#define _NVMADRH_NVMADR13_POSITION                          0x5
#define _NVMADRH_NVMADR13_SIZE                              0x1
#define _NVMADRH_NVMADR13_LENGTH                            0x1
#define _NVMADRH_NVMADR13_MASK                              0x20
#define _NVMADRH_NVMADR14_POSN                              0x6
#define _NVMADRH_NVMADR14_POSITION                          0x6
#define _NVMADRH_NVMADR14_SIZE                              0x1
#define _NVMADRH_NVMADR14_LENGTH                            0x1
#define _NVMADRH_NVMADR14_MASK                              0x40
#define _NVMADRH_EEADRH_POSN                                0x0
#define _NVMADRH_EEADRH_POSITION                            0x0
#define _NVMADRH_EEADRH_SIZE                                0x7
#define _NVMADRH_EEADRH_LENGTH                              0x7
#define _NVMADRH_EEADRH_MASK                                0x7F
#define _NVMADRH_PMADRH_POSN                                0x0
#define _NVMADRH_PMADRH_POSITION                            0x0
#define _NVMADRH_PMADRH_SIZE                                0x7
#define _NVMADRH_PMADRH_LENGTH                              0x7
#define _NVMADRH_PMADRH_MASK                                0x7F
// alias bitfield definitions
typedef union {
    struct {
        unsigned NVMADRH                :7;
    };
    struct {
        unsigned NVMADR8                :1;
        unsigned NVMADR9                :1;
        unsigned NVMADR10               :1;
        unsigned NVMADR11               :1;
        unsigned NVMADR12               :1;
        unsigned NVMADR13               :1;
        unsigned NVMADR14               :1;
    };
    struct {
        unsigned EEADRH                 :7;
    };
    struct {
        unsigned PMADRH                 :7;
    };
} EEADRHbits_t;
extern volatile EEADRHbits_t EEADRHbits __at(0x892);
// bitfield macros
#define _EEADRH_NVMADRH_POSN                                0x0
#define _EEADRH_NVMADRH_POSITION                            0x0
#define _EEADRH_NVMADRH_SIZE                                0x7
#define _EEADRH_NVMADRH_LENGTH                              0x7
#define _EEADRH_NVMADRH_MASK                                0x7F
#define _EEADRH_NVMADR8_POSN                                0x0
#define _EEADRH_NVMADR8_POSITION                            0x0
#define _EEADRH_NVMADR8_SIZE                                0x1
#define _EEADRH_NVMADR8_LENGTH                              0x1
#define _EEADRH_NVMADR8_MASK                                0x1
#define _EEADRH_NVMADR9_POSN                                0x1
#define _EEADRH_NVMADR9_POSITION                            0x1
#define _EEADRH_NVMADR9_SIZE                                0x1
#define _EEADRH_NVMADR9_LENGTH                              0x1
#define _EEADRH_NVMADR9_MASK                                0x2
#define _EEADRH_NVMADR10_POSN                               0x2
#define _EEADRH_NVMADR10_POSITION                           0x2
#define _EEADRH_NVMADR10_SIZE                               0x1
#define _EEADRH_NVMADR10_LENGTH                             0x1
#define _EEADRH_NVMADR10_MASK                               0x4
#define _EEADRH_NVMADR11_POSN                               0x3
#define _EEADRH_NVMADR11_POSITION                           0x3
#define _EEADRH_NVMADR11_SIZE                               0x1
#define _EEADRH_NVMADR11_LENGTH                             0x1
#define _EEADRH_NVMADR11_MASK                               0x8
#define _EEADRH_NVMADR12_POSN                               0x4
#define _EEADRH_NVMADR12_POSITION                           0x4
#define _EEADRH_NVMADR12_SIZE                               0x1
#define _EEADRH_NVMADR12_LENGTH                             0x1
#define _EEADRH_NVMADR12_MASK                               0x10
#define _EEADRH_NVMADR13_POSN                               0x5
#define _EEADRH_NVMADR13_POSITION                           0x5
#define _EEADRH_NVMADR13_SIZE                               0x1
#define _EEADRH_NVMADR13_LENGTH                             0x1
#define _EEADRH_NVMADR13_MASK                               0x20
#define _EEADRH_NVMADR14_POSN                               0x6
#define _EEADRH_NVMADR14_POSITION                           0x6
#define _EEADRH_NVMADR14_SIZE                               0x1
#define _EEADRH_NVMADR14_LENGTH                             0x1
#define _EEADRH_NVMADR14_MASK                               0x40
#define _EEADRH_EEADRH_POSN                                 0x0
#define _EEADRH_EEADRH_POSITION                             0x0
#define _EEADRH_EEADRH_SIZE                                 0x7
#define _EEADRH_EEADRH_LENGTH                               0x7
#define _EEADRH_EEADRH_MASK                                 0x7F
#define _EEADRH_PMADRH_POSN                                 0x0
#define _EEADRH_PMADRH_POSITION                             0x0
#define _EEADRH_PMADRH_SIZE                                 0x7
#define _EEADRH_PMADRH_LENGTH                               0x7
#define _EEADRH_PMADRH_MASK                                 0x7F
typedef union {
    struct {
        unsigned NVMADRH                :7;
    };
    struct {
        unsigned NVMADR8                :1;
        unsigned NVMADR9                :1;
        unsigned NVMADR10               :1;
        unsigned NVMADR11               :1;
        unsigned NVMADR12               :1;
        unsigned NVMADR13               :1;
        unsigned NVMADR14               :1;
    };
    struct {
        unsigned EEADRH                 :7;
    };
    struct {
        unsigned PMADRH                 :7;
    };
} PMADRHbits_t;
extern volatile PMADRHbits_t PMADRHbits __at(0x892);
// bitfield macros
#define _PMADRH_NVMADRH_POSN                                0x0
#define _PMADRH_NVMADRH_POSITION                            0x0
#define _PMADRH_NVMADRH_SIZE                                0x7
#define _PMADRH_NVMADRH_LENGTH                              0x7
#define _PMADRH_NVMADRH_MASK                                0x7F
#define _PMADRH_NVMADR8_POSN                                0x0
#define _PMADRH_NVMADR8_POSITION                            0x0
#define _PMADRH_NVMADR8_SIZE                                0x1
#define _PMADRH_NVMADR8_LENGTH                              0x1
#define _PMADRH_NVMADR8_MASK                                0x1
#define _PMADRH_NVMADR9_POSN                                0x1
#define _PMADRH_NVMADR9_POSITION                            0x1
#define _PMADRH_NVMADR9_SIZE                                0x1
#define _PMADRH_NVMADR9_LENGTH                              0x1
#define _PMADRH_NVMADR9_MASK                                0x2
#define _PMADRH_NVMADR10_POSN                               0x2
#define _PMADRH_NVMADR10_POSITION                           0x2
#define _PMADRH_NVMADR10_SIZE                               0x1
#define _PMADRH_NVMADR10_LENGTH                             0x1
#define _PMADRH_NVMADR10_MASK                               0x4
#define _PMADRH_NVMADR11_POSN                               0x3
#define _PMADRH_NVMADR11_POSITION                           0x3
#define _PMADRH_NVMADR11_SIZE                               0x1
#define _PMADRH_NVMADR11_LENGTH                             0x1
#define _PMADRH_NVMADR11_MASK                               0x8
#define _PMADRH_NVMADR12_POSN                               0x4
#define _PMADRH_NVMADR12_POSITION                           0x4
#define _PMADRH_NVMADR12_SIZE                               0x1
#define _PMADRH_NVMADR12_LENGTH                             0x1
#define _PMADRH_NVMADR12_MASK                               0x10
#define _PMADRH_NVMADR13_POSN                               0x5
#define _PMADRH_NVMADR13_POSITION                           0x5
#define _PMADRH_NVMADR13_SIZE                               0x1
#define _PMADRH_NVMADR13_LENGTH                             0x1
#define _PMADRH_NVMADR13_MASK                               0x20
#define _PMADRH_NVMADR14_POSN                               0x6
#define _PMADRH_NVMADR14_POSITION                           0x6
#define _PMADRH_NVMADR14_SIZE                               0x1
#define _PMADRH_NVMADR14_LENGTH                             0x1
#define _PMADRH_NVMADR14_MASK                               0x40
#define _PMADRH_EEADRH_POSN                                 0x0
#define _PMADRH_EEADRH_POSITION                             0x0
#define _PMADRH_EEADRH_SIZE                                 0x7
#define _PMADRH_EEADRH_LENGTH                               0x7
#define _PMADRH_EEADRH_MASK                                 0x7F
#define _PMADRH_PMADRH_POSN                                 0x0
#define _PMADRH_PMADRH_POSITION                             0x0
#define _PMADRH_PMADRH_SIZE                                 0x7
#define _PMADRH_PMADRH_LENGTH                               0x7
#define _PMADRH_PMADRH_MASK                                 0x7F

// Register: NVMDAT
#define NVMDAT NVMDAT
extern volatile unsigned short          NVMDAT              __at(0x893);
#ifndef _LIB_BUILD
asm("NVMDAT equ 0893h");
#endif
// aliases
extern volatile unsigned short          EEDAT               __at(0x893);
#ifndef _LIB_BUILD
asm("EEDAT equ 0893h");
#endif
extern volatile unsigned short          PMDAT               __at(0x893);
#ifndef _LIB_BUILD
asm("PMDAT equ 0893h");
#endif

// Register: NVMDATL
#define NVMDATL NVMDATL
extern volatile unsigned char           NVMDATL             __at(0x893);
#ifndef _LIB_BUILD
asm("NVMDATL equ 0893h");
#endif
// aliases
extern volatile unsigned char           EEDATL              __at(0x893);
#ifndef _LIB_BUILD
asm("EEDATL equ 0893h");
#endif
extern volatile unsigned char           PMDATL              __at(0x893);
#ifndef _LIB_BUILD
asm("PMDATL equ 0893h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NVMDATL                :8;
    };
    struct {
        unsigned NVMDAT0                :1;
        unsigned NVMDAT1                :1;
        unsigned NVMDAT2                :1;
        unsigned NVMDAT3                :1;
        unsigned NVMDAT4                :1;
        unsigned NVMDAT5                :1;
        unsigned NVMDAT6                :1;
        unsigned NVMDAT7                :1;
    };
    struct {
        unsigned EEDATL                 :8;
    };
    struct {
        unsigned PMDATL                 :8;
    };
} NVMDATLbits_t;
extern volatile NVMDATLbits_t NVMDATLbits __at(0x893);
// bitfield macros
#define _NVMDATL_NVMDATL_POSN                               0x0
#define _NVMDATL_NVMDATL_POSITION                           0x0
#define _NVMDATL_NVMDATL_SIZE                               0x8
#define _NVMDATL_NVMDATL_LENGTH                             0x8
#define _NVMDATL_NVMDATL_MASK                               0xFF
#define _NVMDATL_NVMDAT0_POSN                               0x0
#define _NVMDATL_NVMDAT0_POSITION                           0x0
#define _NVMDATL_NVMDAT0_SIZE                               0x1
#define _NVMDATL_NVMDAT0_LENGTH                             0x1
#define _NVMDATL_NVMDAT0_MASK                               0x1
#define _NVMDATL_NVMDAT1_POSN                               0x1
#define _NVMDATL_NVMDAT1_POSITION                           0x1
#define _NVMDATL_NVMDAT1_SIZE                               0x1
#define _NVMDATL_NVMDAT1_LENGTH                             0x1
#define _NVMDATL_NVMDAT1_MASK                               0x2
#define _NVMDATL_NVMDAT2_POSN                               0x2
#define _NVMDATL_NVMDAT2_POSITION                           0x2
#define _NVMDATL_NVMDAT2_SIZE                               0x1
#define _NVMDATL_NVMDAT2_LENGTH                             0x1
#define _NVMDATL_NVMDAT2_MASK                               0x4
#define _NVMDATL_NVMDAT3_POSN                               0x3
#define _NVMDATL_NVMDAT3_POSITION                           0x3
#define _NVMDATL_NVMDAT3_SIZE                               0x1
#define _NVMDATL_NVMDAT3_LENGTH                             0x1
#define _NVMDATL_NVMDAT3_MASK                               0x8
#define _NVMDATL_NVMDAT4_POSN                               0x4
#define _NVMDATL_NVMDAT4_POSITION                           0x4
#define _NVMDATL_NVMDAT4_SIZE                               0x1
#define _NVMDATL_NVMDAT4_LENGTH                             0x1
#define _NVMDATL_NVMDAT4_MASK                               0x10
#define _NVMDATL_NVMDAT5_POSN                               0x5
#define _NVMDATL_NVMDAT5_POSITION                           0x5
#define _NVMDATL_NVMDAT5_SIZE                               0x1
#define _NVMDATL_NVMDAT5_LENGTH                             0x1
#define _NVMDATL_NVMDAT5_MASK                               0x20
#define _NVMDATL_NVMDAT6_POSN                               0x6
#define _NVMDATL_NVMDAT6_POSITION                           0x6
#define _NVMDATL_NVMDAT6_SIZE                               0x1
#define _NVMDATL_NVMDAT6_LENGTH                             0x1
#define _NVMDATL_NVMDAT6_MASK                               0x40
#define _NVMDATL_NVMDAT7_POSN                               0x7
#define _NVMDATL_NVMDAT7_POSITION                           0x7
#define _NVMDATL_NVMDAT7_SIZE                               0x1
#define _NVMDATL_NVMDAT7_LENGTH                             0x1
#define _NVMDATL_NVMDAT7_MASK                               0x80
#define _NVMDATL_EEDATL_POSN                                0x0
#define _NVMDATL_EEDATL_POSITION                            0x0
#define _NVMDATL_EEDATL_SIZE                                0x8
#define _NVMDATL_EEDATL_LENGTH                              0x8
#define _NVMDATL_EEDATL_MASK                                0xFF
#define _NVMDATL_PMDATL_POSN                                0x0
#define _NVMDATL_PMDATL_POSITION                            0x0
#define _NVMDATL_PMDATL_SIZE                                0x8
#define _NVMDATL_PMDATL_LENGTH                              0x8
#define _NVMDATL_PMDATL_MASK                                0xFF
// alias bitfield definitions
typedef union {
    struct {
        unsigned NVMDATL                :8;
    };
    struct {
        unsigned NVMDAT0                :1;
        unsigned NVMDAT1                :1;
        unsigned NVMDAT2                :1;
        unsigned NVMDAT3                :1;
        unsigned NVMDAT4                :1;
        unsigned NVMDAT5                :1;
        unsigned NVMDAT6                :1;
        unsigned NVMDAT7                :1;
    };
    struct {
        unsigned EEDATL                 :8;
    };
    struct {
        unsigned PMDATL                 :8;
    };
} EEDATLbits_t;
extern volatile EEDATLbits_t EEDATLbits __at(0x893);
// bitfield macros
#define _EEDATL_NVMDATL_POSN                                0x0
#define _EEDATL_NVMDATL_POSITION                            0x0
#define _EEDATL_NVMDATL_SIZE                                0x8
#define _EEDATL_NVMDATL_LENGTH                              0x8
#define _EEDATL_NVMDATL_MASK                                0xFF
#define _EEDATL_NVMDAT0_POSN                                0x0
#define _EEDATL_NVMDAT0_POSITION                            0x0
#define _EEDATL_NVMDAT0_SIZE                                0x1
#define _EEDATL_NVMDAT0_LENGTH                              0x1
#define _EEDATL_NVMDAT0_MASK                                0x1
#define _EEDATL_NVMDAT1_POSN                                0x1
#define _EEDATL_NVMDAT1_POSITION                            0x1
#define _EEDATL_NVMDAT1_SIZE                                0x1
#define _EEDATL_NVMDAT1_LENGTH                              0x1
#define _EEDATL_NVMDAT1_MASK                                0x2
#define _EEDATL_NVMDAT2_POSN                                0x2
#define _EEDATL_NVMDAT2_POSITION                            0x2
#define _EEDATL_NVMDAT2_SIZE                                0x1
#define _EEDATL_NVMDAT2_LENGTH                              0x1
#define _EEDATL_NVMDAT2_MASK                                0x4
#define _EEDATL_NVMDAT3_POSN                                0x3
#define _EEDATL_NVMDAT3_POSITION                            0x3
#define _EEDATL_NVMDAT3_SIZE                                0x1
#define _EEDATL_NVMDAT3_LENGTH                              0x1
#define _EEDATL_NVMDAT3_MASK                                0x8
#define _EEDATL_NVMDAT4_POSN                                0x4
#define _EEDATL_NVMDAT4_POSITION                            0x4
#define _EEDATL_NVMDAT4_SIZE                                0x1
#define _EEDATL_NVMDAT4_LENGTH                              0x1
#define _EEDATL_NVMDAT4_MASK                                0x10
#define _EEDATL_NVMDAT5_POSN                                0x5
#define _EEDATL_NVMDAT5_POSITION                            0x5
#define _EEDATL_NVMDAT5_SIZE                                0x1
#define _EEDATL_NVMDAT5_LENGTH                              0x1
#define _EEDATL_NVMDAT5_MASK                                0x20
#define _EEDATL_NVMDAT6_POSN                                0x6
#define _EEDATL_NVMDAT6_POSITION                            0x6
#define _EEDATL_NVMDAT6_SIZE                                0x1
#define _EEDATL_NVMDAT6_LENGTH                              0x1
#define _EEDATL_NVMDAT6_MASK                                0x40
#define _EEDATL_NVMDAT7_POSN                                0x7
#define _EEDATL_NVMDAT7_POSITION                            0x7
#define _EEDATL_NVMDAT7_SIZE                                0x1
#define _EEDATL_NVMDAT7_LENGTH                              0x1
#define _EEDATL_NVMDAT7_MASK                                0x80
#define _EEDATL_EEDATL_POSN                                 0x0
#define _EEDATL_EEDATL_POSITION                             0x0
#define _EEDATL_EEDATL_SIZE                                 0x8
#define _EEDATL_EEDATL_LENGTH                               0x8
#define _EEDATL_EEDATL_MASK                                 0xFF
#define _EEDATL_PMDATL_POSN                                 0x0
#define _EEDATL_PMDATL_POSITION                             0x0
#define _EEDATL_PMDATL_SIZE                                 0x8
#define _EEDATL_PMDATL_LENGTH                               0x8
#define _EEDATL_PMDATL_MASK                                 0xFF
typedef union {
    struct {
        unsigned NVMDATL                :8;
    };
    struct {
        unsigned NVMDAT0                :1;
        unsigned NVMDAT1                :1;
        unsigned NVMDAT2                :1;
        unsigned NVMDAT3                :1;
        unsigned NVMDAT4                :1;
        unsigned NVMDAT5                :1;
        unsigned NVMDAT6                :1;
        unsigned NVMDAT7                :1;
    };
    struct {
        unsigned EEDATL                 :8;
    };
    struct {
        unsigned PMDATL                 :8;
    };
} PMDATLbits_t;
