MikroElektronika/core_packages/PIC/XC8/def/PIC16F18326/mcu.h
#define                                 CWG1DBR3_bit        _BIT_ACCESS(CWG1DBR,3)
// CWG1DBR<CWG1DBR4>
extern volatile __bit                   CWG1DBR4            __at(0x349C);	// @ (0x693 * 8 + 4)
#define                                 CWG1DBR4_bit        _BIT_ACCESS(CWG1DBR,4)
// CWG1DBR<CWG1DBR5>
extern volatile __bit                   CWG1DBR5            __at(0x349D);	// @ (0x693 * 8 + 5)
#define                                 CWG1DBR5_bit        _BIT_ACCESS(CWG1DBR,5)
// CWG1CON0<CWG1EN>
extern volatile __bit                   CWG1EN              __at(0x34AF);	// @ (0x695 * 8 + 7)
#define                                 CWG1EN_bit          _BIT_ACCESS(CWG1CON0,7)
// PIE4<CWG1IE>
extern volatile __bit                   CWG1IE              __at(0x4A6);	// @ (0x94 * 8 + 6)
#define                                 CWG1IE_bit          _BIT_ACCESS(PIE4,6)
// PIR4<CWG1IF>
extern volatile __bit                   CWG1IF              __at(0xA6);	// @ (0x14 * 8 + 6)
#define                                 CWG1IF_bit          _BIT_ACCESS(PIR4,6)
// CWG1CON1<CWG1IN>
extern volatile __bit                   CWG1IN              __at(0x34B5);	// @ (0x696 * 8 + 5)
#define                                 CWG1IN_bit          _BIT_ACCESS(CWG1CON1,5)
// CWG1CON0<CWG1LD>
extern volatile __bit                   CWG1LD              __at(0x34AE);	// @ (0x695 * 8 + 6)
#define                                 CWG1LD_bit          _BIT_ACCESS(CWG1CON0,6)
// CWG1AS0<CWG1LSAC0>
extern volatile __bit                   CWG1LSAC0           __at(0x34BA);	// @ (0x697 * 8 + 2)
#define                                 CWG1LSAC0_bit       _BIT_ACCESS(CWG1AS0,2)
// CWG1AS0<CWG1LSAC1>
extern volatile __bit                   CWG1LSAC1           __at(0x34BB);	// @ (0x697 * 8 + 3)
#define                                 CWG1LSAC1_bit       _BIT_ACCESS(CWG1AS0,3)
// CWG1AS0<CWG1LSBD0>
extern volatile __bit                   CWG1LSBD0           __at(0x34BC);	// @ (0x697 * 8 + 4)
#define                                 CWG1LSBD0_bit       _BIT_ACCESS(CWG1AS0,4)
// CWG1AS0<CWG1LSBD1>
extern volatile __bit                   CWG1LSBD1           __at(0x34BD);	// @ (0x697 * 8 + 5)
#define                                 CWG1LSBD1_bit       _BIT_ACCESS(CWG1AS0,5)
// PMD3<CWG1MD>
extern volatile __bit                   CWG1MD              __at(0x48A6);	// @ (0x914 * 8 + 6)
#define                                 CWG1MD_bit          _BIT_ACCESS(PMD3,6)
// CWG1CON0<CWG1MODE0>
extern volatile __bit                   CWG1MODE0           __at(0x34A8);	// @ (0x695 * 8 + 0)
#define                                 CWG1MODE0_bit       _BIT_ACCESS(CWG1CON0,0)
// CWG1CON0<CWG1MODE1>
extern volatile __bit                   CWG1MODE1           __at(0x34A9);	// @ (0x695 * 8 + 1)
#define                                 CWG1MODE1_bit       _BIT_ACCESS(CWG1CON0,1)
// CWG1CON0<CWG1MODE2>
extern volatile __bit                   CWG1MODE2           __at(0x34AA);	// @ (0x695 * 8 + 2)
#define                                 CWG1MODE2_bit       _BIT_ACCESS(CWG1CON0,2)
// CWG1STR<CWG1OVRA>
extern volatile __bit                   CWG1OVRA            __at(0x34CC);	// @ (0x699 * 8 + 4)
#define                                 CWG1OVRA_bit        _BIT_ACCESS(CWG1STR,4)
// CWG1STR<CWG1OVRB>
extern volatile __bit                   CWG1OVRB            __at(0x34CD);	// @ (0x699 * 8 + 5)
#define                                 CWG1OVRB_bit        _BIT_ACCESS(CWG1STR,5)
// CWG1STR<CWG1OVRC>
extern volatile __bit                   CWG1OVRC            __at(0x34CE);	// @ (0x699 * 8 + 6)
#define                                 CWG1OVRC_bit        _BIT_ACCESS(CWG1STR,6)
// CWG1STR<CWG1OVRD>
extern volatile __bit                   CWG1OVRD            __at(0x34CF);	// @ (0x699 * 8 + 7)
#define                                 CWG1OVRD_bit        _BIT_ACCESS(CWG1STR,7)
// CWG1CON1<CWG1POLA>
extern volatile __bit                   CWG1POLA            __at(0x34B0);	// @ (0x696 * 8 + 0)
#define                                 CWG1POLA_bit        _BIT_ACCESS(CWG1CON1,0)
// CWG1CON1<CWG1POLB>
extern volatile __bit                   CWG1POLB            __at(0x34B1);	// @ (0x696 * 8 + 1)
#define                                 CWG1POLB_bit        _BIT_ACCESS(CWG1CON1,1)
// CWG1CON1<CWG1POLC>
extern volatile __bit                   CWG1POLC            __at(0x34B2);	// @ (0x696 * 8 + 2)
#define                                 CWG1POLC_bit        _BIT_ACCESS(CWG1CON1,2)
// CWG1CON1<CWG1POLD>
extern volatile __bit                   CWG1POLD            __at(0x34B3);	// @ (0x696 * 8 + 3)
#define                                 CWG1POLD_bit        _BIT_ACCESS(CWG1CON1,3)
// CWG1PPS<CWG1PPS0>
extern volatile __bit                   CWG1PPS0            __at(0x70C0);	// @ (0xE18 * 8 + 0)
#define                                 CWG1PPS0_bit        _BIT_ACCESS(CWG1PPS,0)
// CWG1PPS<CWG1PPS1>
extern volatile __bit                   CWG1PPS1            __at(0x70C1);	// @ (0xE18 * 8 + 1)
#define                                 CWG1PPS1_bit        _BIT_ACCESS(CWG1PPS,1)
// CWG1PPS<CWG1PPS2>
extern volatile __bit                   CWG1PPS2            __at(0x70C2);	// @ (0xE18 * 8 + 2)
#define                                 CWG1PPS2_bit        _BIT_ACCESS(CWG1PPS,2)
// CWG1PPS<CWG1PPS3>
extern volatile __bit                   CWG1PPS3            __at(0x70C3);	// @ (0xE18 * 8 + 3)
#define                                 CWG1PPS3_bit        _BIT_ACCESS(CWG1PPS,3)
// CWG1PPS<CWG1PPS4>
extern volatile __bit                   CWG1PPS4            __at(0x70C4);	// @ (0xE18 * 8 + 4)
#define                                 CWG1PPS4_bit        _BIT_ACCESS(CWG1PPS,4)
// CWG1AS0<CWG1REN>
extern volatile __bit                   CWG1REN             __at(0x34BE);	// @ (0x697 * 8 + 6)
#define                                 CWG1REN_bit         _BIT_ACCESS(CWG1AS0,6)
// CWG1AS0<CWG1SHUTDOWN>
extern volatile __bit                   CWG1SHUTDOWN        __at(0x34BF);	// @ (0x697 * 8 + 7)
#define                                 CWG1SHUTDOWN_bit    _BIT_ACCESS(CWG1AS0,7)
// CWG1STR<CWG1STRA>
extern volatile __bit                   CWG1STRA            __at(0x34C8);	// @ (0x699 * 8 + 0)
#define                                 CWG1STRA_bit        _BIT_ACCESS(CWG1STR,0)
// CWG1STR<CWG1STRB>
extern volatile __bit                   CWG1STRB            __at(0x34C9);	// @ (0x699 * 8 + 1)
#define                                 CWG1STRB_bit        _BIT_ACCESS(CWG1STR,1)
// CWG1STR<CWG1STRC>
extern volatile __bit                   CWG1STRC            __at(0x34CA);	// @ (0x699 * 8 + 2)
#define                                 CWG1STRC_bit        _BIT_ACCESS(CWG1STR,2)
// CWG1STR<CWG1STRD>
extern volatile __bit                   CWG1STRD            __at(0x34CB);	// @ (0x699 * 8 + 3)
#define                                 CWG1STRD_bit        _BIT_ACCESS(CWG1STR,3)
// CWG2CLKCON<CWG2CS>
extern volatile __bit                   CWG2CS              __at(0x3888);	// @ (0x711 * 8 + 0)
#define                                 CWG2CS_bit          _BIT_ACCESS(CWG2CLKCON,0)
// CWG2DAT<CWG2DAT0>
extern volatile __bit                   CWG2DAT0            __at(0x3890);	// @ (0x712 * 8 + 0)
#define                                 CWG2DAT0_bit        _BIT_ACCESS(CWG2DAT,0)
// CWG2DAT<CWG2DAT1>
extern volatile __bit                   CWG2DAT1            __at(0x3891);	// @ (0x712 * 8 + 1)
#define                                 CWG2DAT1_bit        _BIT_ACCESS(CWG2DAT,1)
// CWG2DAT<CWG2DAT2>
extern volatile __bit                   CWG2DAT2            __at(0x3892);	// @ (0x712 * 8 + 2)
#define                                 CWG2DAT2_bit        _BIT_ACCESS(CWG2DAT,2)
// CWG2DAT<CWG2DAT3>
extern volatile __bit                   CWG2DAT3            __at(0x3893);	// @ (0x712 * 8 + 3)
#define                                 CWG2DAT3_bit        _BIT_ACCESS(CWG2DAT,3)
// CWG2DBF<CWG2DBF0>
extern volatile __bit                   CWG2DBF0            __at(0x38A0);	// @ (0x714 * 8 + 0)
#define                                 CWG2DBF0_bit        _BIT_ACCESS(CWG2DBF,0)
// CWG2DBF<CWG2DBF1>
extern volatile __bit                   CWG2DBF1            __at(0x38A1);	// @ (0x714 * 8 + 1)
#define                                 CWG2DBF1_bit        _BIT_ACCESS(CWG2DBF,1)
// CWG2DBF<CWG2DBF2>
extern volatile __bit                   CWG2DBF2            __at(0x38A2);	// @ (0x714 * 8 + 2)
#define                                 CWG2DBF2_bit        _BIT_ACCESS(CWG2DBF,2)
// CWG2DBF<CWG2DBF3>
extern volatile __bit                   CWG2DBF3            __at(0x38A3);	// @ (0x714 * 8 + 3)
#define                                 CWG2DBF3_bit        _BIT_ACCESS(CWG2DBF,3)
// CWG2DBF<CWG2DBF4>
extern volatile __bit                   CWG2DBF4            __at(0x38A4);	// @ (0x714 * 8 + 4)
#define                                 CWG2DBF4_bit        _BIT_ACCESS(CWG2DBF,4)
// CWG2DBF<CWG2DBF5>
extern volatile __bit                   CWG2DBF5            __at(0x38A5);	// @ (0x714 * 8 + 5)
#define                                 CWG2DBF5_bit        _BIT_ACCESS(CWG2DBF,5)
// CWG2DBR<CWG2DBR0>
extern volatile __bit                   CWG2DBR0            __at(0x3898);	// @ (0x713 * 8 + 0)
#define                                 CWG2DBR0_bit        _BIT_ACCESS(CWG2DBR,0)
// CWG2DBR<CWG2DBR1>
extern volatile __bit                   CWG2DBR1            __at(0x3899);	// @ (0x713 * 8 + 1)
#define                                 CWG2DBR1_bit        _BIT_ACCESS(CWG2DBR,1)
// CWG2DBR<CWG2DBR2>
extern volatile __bit                   CWG2DBR2            __at(0x389A);	// @ (0x713 * 8 + 2)
#define                                 CWG2DBR2_bit        _BIT_ACCESS(CWG2DBR,2)
// CWG2DBR<CWG2DBR3>
extern volatile __bit                   CWG2DBR3            __at(0x389B);	// @ (0x713 * 8 + 3)
#define                                 CWG2DBR3_bit        _BIT_ACCESS(CWG2DBR,3)
// CWG2DBR<CWG2DBR4>
extern volatile __bit                   CWG2DBR4            __at(0x389C);	// @ (0x713 * 8 + 4)
#define                                 CWG2DBR4_bit        _BIT_ACCESS(CWG2DBR,4)
// CWG2DBR<CWG2DBR5>
extern volatile __bit                   CWG2DBR5            __at(0x389D);	// @ (0x713 * 8 + 5)
#define                                 CWG2DBR5_bit        _BIT_ACCESS(CWG2DBR,5)
// CWG2CON0<CWG2EN>
extern volatile __bit                   CWG2EN              __at(0x38AF);	// @ (0x715 * 8 + 7)
#define                                 CWG2EN_bit          _BIT_ACCESS(CWG2CON0,7)
// PIE4<CWG2IE>
extern volatile __bit                   CWG2IE              __at(0x4A7);	// @ (0x94 * 8 + 7)
#define                                 CWG2IE_bit          _BIT_ACCESS(PIE4,7)
// PIR4<CWG2IF>
extern volatile __bit                   CWG2IF              __at(0xA7);	// @ (0x14 * 8 + 7)
#define                                 CWG2IF_bit          _BIT_ACCESS(PIR4,7)
// CWG2CON1<CWG2IN>
extern volatile __bit                   CWG2IN              __at(0x38B5);	// @ (0x716 * 8 + 5)
#define                                 CWG2IN_bit          _BIT_ACCESS(CWG2CON1,5)
// CWG2CON0<CWG2LD>
extern volatile __bit                   CWG2LD              __at(0x38AE);	// @ (0x715 * 8 + 6)
#define                                 CWG2LD_bit          _BIT_ACCESS(CWG2CON0,6)
// CWG2AS0<CWG2LSAC0>
extern volatile __bit                   CWG2LSAC0           __at(0x38BA);	// @ (0x717 * 8 + 2)
#define                                 CWG2LSAC0_bit       _BIT_ACCESS(CWG2AS0,2)
// CWG2AS0<CWG2LSAC1>
extern volatile __bit                   CWG2LSAC1           __at(0x38BB);	// @ (0x717 * 8 + 3)
#define                                 CWG2LSAC1_bit       _BIT_ACCESS(CWG2AS0,3)
// CWG2AS0<CWG2LSBD0>
extern volatile __bit                   CWG2LSBD0           __at(0x38BC);	// @ (0x717 * 8 + 4)
#define                                 CWG2LSBD0_bit       _BIT_ACCESS(CWG2AS0,4)
// CWG2AS0<CWG2LSBD1>
extern volatile __bit                   CWG2LSBD1           __at(0x38BD);	// @ (0x717 * 8 + 5)
#define                                 CWG2LSBD1_bit       _BIT_ACCESS(CWG2AS0,5)
// PMD3<CWG2MD>
extern volatile __bit                   CWG2MD              __at(0x48A7);	// @ (0x914 * 8 + 7)
#define                                 CWG2MD_bit          _BIT_ACCESS(PMD3,7)
// CWG2CON0<CWG2MODE0>
extern volatile __bit                   CWG2MODE0           __at(0x38A8);	// @ (0x715 * 8 + 0)
#define                                 CWG2MODE0_bit       _BIT_ACCESS(CWG2CON0,0)
// CWG2CON0<CWG2MODE1>
extern volatile __bit                   CWG2MODE1           __at(0x38A9);	// @ (0x715 * 8 + 1)
#define                                 CWG2MODE1_bit       _BIT_ACCESS(CWG2CON0,1)
// CWG2CON0<CWG2MODE2>
extern volatile __bit                   CWG2MODE2           __at(0x38AA);	// @ (0x715 * 8 + 2)
#define                                 CWG2MODE2_bit       _BIT_ACCESS(CWG2CON0,2)
// CWG2STR<CWG2OVRA>
extern volatile __bit                   CWG2OVRA            __at(0x38CC);	// @ (0x719 * 8 + 4)
#define                                 CWG2OVRA_bit        _BIT_ACCESS(CWG2STR,4)
// CWG2STR<CWG2OVRB>
extern volatile __bit                   CWG2OVRB            __at(0x38CD);	// @ (0x719 * 8 + 5)
#define                                 CWG2OVRB_bit        _BIT_ACCESS(CWG2STR,5)
// CWG2STR<CWG2OVRC>
extern volatile __bit                   CWG2OVRC            __at(0x38CE);	// @ (0x719 * 8 + 6)
#define                                 CWG2OVRC_bit        _BIT_ACCESS(CWG2STR,6)
// CWG2STR<CWG2OVRD>
extern volatile __bit                   CWG2OVRD            __at(0x38CF);	// @ (0x719 * 8 + 7)
#define                                 CWG2OVRD_bit        _BIT_ACCESS(CWG2STR,7)
// CWG2CON1<CWG2POLA>
extern volatile __bit                   CWG2POLA            __at(0x38B0);	// @ (0x716 * 8 + 0)
#define                                 CWG2POLA_bit        _BIT_ACCESS(CWG2CON1,0)
// CWG2CON1<CWG2POLB>
extern volatile __bit                   CWG2POLB            __at(0x38B1);	// @ (0x716 * 8 + 1)
#define                                 CWG2POLB_bit        _BIT_ACCESS(CWG2CON1,1)
// CWG2CON1<CWG2POLC>
extern volatile __bit                   CWG2POLC            __at(0x38B2);	// @ (0x716 * 8 + 2)
#define                                 CWG2POLC_bit        _BIT_ACCESS(CWG2CON1,2)
// CWG2CON1<CWG2POLD>
extern volatile __bit                   CWG2POLD            __at(0x38B3);	// @ (0x716 * 8 + 3)
#define                                 CWG2POLD_bit        _BIT_ACCESS(CWG2CON1,3)
// CWG2PPS<CWG2PPS0>
extern volatile __bit                   CWG2PPS0            __at(0x70C8);	// @ (0xE19 * 8 + 0)
#define                                 CWG2PPS0_bit        _BIT_ACCESS(CWG2PPS,0)
// CWG2PPS<CWG2PPS1>
extern volatile __bit                   CWG2PPS1            __at(0x70C9);	// @ (0xE19 * 8 + 1)
#define                                 CWG2PPS1_bit        _BIT_ACCESS(CWG2PPS,1)
// CWG2PPS<CWG2PPS2>
extern volatile __bit                   CWG2PPS2            __at(0x70CA);	// @ (0xE19 * 8 + 2)
#define                                 CWG2PPS2_bit        _BIT_ACCESS(CWG2PPS,2)
// CWG2PPS<CWG2PPS3>
extern volatile __bit                   CWG2PPS3            __at(0x70CB);	// @ (0xE19 * 8 + 3)
#define                                 CWG2PPS3_bit        _BIT_ACCESS(CWG2PPS,3)
// CWG2PPS<CWG2PPS4>
extern volatile __bit                   CWG2PPS4            __at(0x70CC);	// @ (0xE19 * 8 + 4)
#define                                 CWG2PPS4_bit        _BIT_ACCESS(CWG2PPS,4)
// CWG2AS0<CWG2REN>
extern volatile __bit                   CWG2REN             __at(0x38BE);	// @ (0x717 * 8 + 6)
#define                                 CWG2REN_bit         _BIT_ACCESS(CWG2AS0,6)
// CWG2AS0<CWG2SHUTDOWN>
extern volatile __bit                   CWG2SHUTDOWN        __at(0x38BF);	// @ (0x717 * 8 + 7)
#define                                 CWG2SHUTDOWN_bit    _BIT_ACCESS(CWG2AS0,7)
// CWG2STR<CWG2STRA>
extern volatile __bit                   CWG2STRA            __at(0x38C8);	// @ (0x719 * 8 + 0)
#define                                 CWG2STRA_bit        _BIT_ACCESS(CWG2STR,0)
// CWG2STR<CWG2STRB>
extern volatile __bit                   CWG2STRB            __at(0x38C9);	// @ (0x719 * 8 + 1)
#define                                 CWG2STRB_bit        _BIT_ACCESS(CWG2STR,1)
// CWG2STR<CWG2STRC>
extern volatile __bit                   CWG2STRC            __at(0x38CA);	// @ (0x719 * 8 + 2)
#define                                 CWG2STRC_bit        _BIT_ACCESS(CWG2STR,2)
// CWG2STR<CWG2STRD>
extern volatile __bit                   CWG2STRD            __at(0x38CB);	// @ (0x719 * 8 + 3)
#define                                 CWG2STRD_bit        _BIT_ACCESS(CWG2STR,3)
// STATUS_SHAD<C_SHAD>
extern volatile __bit                   C_SHAD              __at(0x7F20);	// @ (0xFE4 * 8 + 0)
#define                                 C_SHAD_bit          _BIT_ACCESS(STATUS_SHAD,0)
// DACCON0<DAC1EN>
extern volatile __bit                   DAC1EN              __at(0x8C7);	// @ (0x118 * 8 + 7)
#define                                 DAC1EN_bit          _BIT_ACCESS(DACCON0,7)
// DACCON0<DAC1NSS>
extern volatile __bit                   DAC1NSS             __at(0x8C0);	// @ (0x118 * 8 + 0)
#define                                 DAC1NSS_bit         _BIT_ACCESS(DACCON0,0)
// DACCON0<DAC1OE>
extern volatile __bit                   DAC1OE              __at(0x8C5);	// @ (0x118 * 8 + 5)
#define                                 DAC1OE_bit          _BIT_ACCESS(DACCON0,5)
// DACCON0<DAC1PSS0>
extern volatile __bit                   DAC1PSS0            __at(0x8C2);	// @ (0x118 * 8 + 2)
#define                                 DAC1PSS0_bit        _BIT_ACCESS(DACCON0,2)
// DACCON0<DAC1PSS1>
extern volatile __bit                   DAC1PSS1            __at(0x8C3);	// @ (0x118 * 8 + 3)
#define                                 DAC1PSS1_bit        _BIT_ACCESS(DACCON0,3)
// DACCON1<DAC1R0>
extern volatile __bit                   DAC1R0              __at(0x8C8);	// @ (0x119 * 8 + 0)
#define                                 DAC1R0_bit          _BIT_ACCESS(DACCON1,0)
// DACCON1<DAC1R1>
extern volatile __bit                   DAC1R1              __at(0x8C9);	// @ (0x119 * 8 + 1)
#define                                 DAC1R1_bit          _BIT_ACCESS(DACCON1,1)
// DACCON1<DAC1R2>
extern volatile __bit                   DAC1R2              __at(0x8CA);	// @ (0x119 * 8 + 2)
#define                                 DAC1R2_bit          _BIT_ACCESS(DACCON1,2)
// DACCON1<DAC1R3>
extern volatile __bit                   DAC1R3              __at(0x8CB);	// @ (0x119 * 8 + 3)
#define                                 DAC1R3_bit          _BIT_ACCESS(DACCON1,3)
// DACCON1<DAC1R4>
extern volatile __bit                   DAC1R4              __at(0x8CC);	// @ (0x119 * 8 + 4)
#define                                 DAC1R4_bit          _BIT_ACCESS(DACCON1,4)
// PMD2<DACMD>
extern volatile __bit                   DACMD               __at(0x489E);	// @ (0x913 * 8 + 6)
#define                                 DACMD_bit           _BIT_ACCESS(PMD2,6)
// STATUS<DC>
extern volatile __bit                   DC                  __at(0x19);	// @ (0x3 * 8 + 1)
#define                                 DC_bit              _BIT_ACCESS(STATUS,1)
// STATUS_SHAD<DC_SHAD>
extern volatile __bit                   DC_SHAD             __at(0x7F21);	// @ (0xFE4 * 8 + 1)
#define                                 DC_SHAD_bit         _BIT_ACCESS(STATUS_SHAD,1)
// CPUDOZE<DOE>
extern volatile __bit                   DOE                 __at(0x48C4);	// @ (0x918 * 8 + 4)
#define                                 DOE_bit             _BIT_ACCESS(CPUDOZE,4)
// CPUDOZE<DOZE0>
extern volatile __bit                   DOZE0               __at(0x48C0);	// @ (0x918 * 8 + 0)
#define                                 DOZE0_bit           _BIT_ACCESS(CPUDOZE,0)
// CPUDOZE<DOZE1>
extern volatile __bit                   DOZE1               __at(0x48C1);	// @ (0x918 * 8 + 1)
#define                                 DOZE1_bit           _BIT_ACCESS(CPUDOZE,1)
// CPUDOZE<DOZE2>
extern volatile __bit                   DOZE2               __at(0x48C2);	// @ (0x918 * 8 + 2)
#define                                 DOZE2_bit           _BIT_ACCESS(CPUDOZE,2)
// CPUDOZE<DOZEN>
extern volatile __bit                   DOZEN               __at(0x48C6);	// @ (0x918 * 8 + 6)
#define                                 DOZEN_bit           _BIT_ACCESS(CPUDOZE,6)
// PMD5<DSMMD>
extern volatile __bit                   DSMMD               __at(0x48B0);	// @ (0x916 * 8 + 0)
#define                                 DSMMD_bit           _BIT_ACCESS(PMD5,0)
// OSCEN<EXTOEN>
extern volatile __bit                   EXTOEN              __at(0x48EF);	// @ (0x91D * 8 + 7)
#define                                 EXTOEN_bit          _BIT_ACCESS(OSCEN,7)
// OSCSTAT1<EXTOR>
extern volatile __bit                   EXTOR               __at(0x48E7);	// @ (0x91C * 8 + 7)
#define                                 EXTOR_bit           _BIT_ACCESS(OSCSTAT1,7)
// RC1STA<FERR>
extern volatile __bit                   FERR                __at(0xCEA);	// @ (0x19D * 8 + 2)
#define                                 FERR_bit            _BIT_ACCESS(RC1STA,2)
// NVMCON1<FREE>
extern volatile __bit                   FREE                __at(0x44AC);	// @ (0x895 * 8 + 4)
#define                                 FREE_bit            _BIT_ACCESS(NVMCON1,4)
// FVRCON<FVREN>
extern volatile __bit                   FVREN               __at(0x8BF);	// @ (0x117 * 8 + 7)
#define                                 FVREN_bit           _BIT_ACCESS(FVRCON,7)
// PMD0<FVRMD>
extern volatile __bit                   FVRMD               __at(0x488E);	// @ (0x911 * 8 + 6)
#define                                 FVRMD_bit           _BIT_ACCESS(PMD0,6)
// FVRCON<FVRRDY>
extern volatile __bit                   FVRRDY              __at(0x8BE);	// @ (0x117 * 8 + 6)
#define                                 FVRRDY_bit          _BIT_ACCESS(FVRCON,6)
// CWG1CON0<G1EN>
extern volatile __bit                   G1EN                __at(0x34AF);	// @ (0x695 * 8 + 7)
#define                                 G1EN_bit            _BIT_ACCESS(CWG1CON0,7)
// CWG2CON0<G2EN>
extern volatile __bit                   G2EN                __at(0x38AF);	// @ (0x715 * 8 + 7)
#define                                 G2EN_bit            _BIT_ACCESS(CWG2CON0,7)
// INTCON<GIE>
extern volatile __bit                   GIE                 __at(0x5F);	// @ (0xB * 8 + 7)
#define                                 GIE_bit             _BIT_ACCESS(INTCON,7)
// ADCON0<GO>
extern volatile __bit                   GO                  __at(0x4E9);	// @ (0x9D * 8 + 1)
#define                                 GO_bit              _BIT_ACCESS(ADCON0,1)
// ADCON0<GO_nDONE>
extern volatile __bit                   GO_nDONE            __at(0x4E9);	// @ (0x9D * 8 + 1)
#define                                 GO_nDONE_bit        _BIT_ACCESS(ADCON0,1)
// OSCFRQ<HFFRQ0>
extern volatile __bit                   HFFRQ0              __at(0x48F8);	// @ (0x91F * 8 + 0)
#define                                 HFFRQ0_bit          _BIT_ACCESS(OSCFRQ,0)
// OSCFRQ<HFFRQ1>
extern volatile __bit                   HFFRQ1              __at(0x48F9);	// @ (0x91F * 8 + 1)
#define                                 HFFRQ1_bit          _BIT_ACCESS(OSCFRQ,1)
// OSCFRQ<HFFRQ2>
extern volatile __bit                   HFFRQ2              __at(0x48FA);	// @ (0x91F * 8 + 2)
#define                                 HFFRQ2_bit          _BIT_ACCESS(OSCFRQ,2)
// OSCFRQ<HFFRQ3>
extern volatile __bit                   HFFRQ3              __at(0x48FB);	// @ (0x91F * 8 + 3)
#define                                 HFFRQ3_bit          _BIT_ACCESS(OSCFRQ,3)
// OSCEN<HFOEN>
extern volatile __bit                   HFOEN               __at(0x48EE);	// @ (0x91D * 8 + 6)
#define                                 HFOEN_bit           _BIT_ACCESS(OSCEN,6)
// OSCSTAT1<HFOR>
extern volatile __bit                   HFOR                __at(0x48E6);	// @ (0x91C * 8 + 6)
